name: "CIFAR100_nin_sc"
layer {
  name: "cifar"
  type: "Data" 
  top: "data"
  top: "label"
  transform_param {
    mirror: true
    crop_size: 26
  }
  data_param {
	source: "../cifar100/cifar_train"
	backend: LMDB
    batch_size: 128
  }
  include: { phase: TRAIN }
}
layer {
  name: "cifar"
  type: "Data"
  top: "data"
  top: "label"
  transform_param {
    mirror: false
    crop_size: 26
  }
  data_param {
	source: "../cifar100/cifar_test"
	backend: LMDB
    batch_size: 100
  }
  include: { phase: TEST }
}
layer {
  name: "conv1"
  type: "Convolution" 
  bottom: "data"
  top: "conv1"
  param {
	  lr_mult: 1
	  decay_mult: 1
  }
  param {
	  lr_mult: 2
	  decay_mult: 0
  }
  convolution_param {
    num_output: 192
    pad: 5
    kernel_size: 5
    weight_filler {
      type: "gaussian"
      std: 0.05
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu1"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}
layer {
  name: "cccp1"
  type: "Convolution" 
  bottom: "conv1"
  top: "cccp1"
  param {
	  lr_mult: 1
	  decay_mult: 1
  }
  param {
	  lr_mult: 2
	  decay_mult: 0
  }
  convolution_param {
    num_output: 160
    group: 1
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.05
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu_cccp1"
  type: "ReLU"
  bottom: "cccp1"
  top: "cccp1"
}
layer {
  name: "cccp2"
  type: "Convolution" 
  bottom: "cccp1"
  top: "cccp2"
  param {
	  lr_mult: 1
	  decay_mult: 1
  }
  param {
	  lr_mult: 2
	  decay_mult: 0
  }
  convolution_param {
    num_output: 96
    group: 1
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.05
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu_cccp2"
  type: "ReLU"
  bottom: "cccp2"
  top: "cccp2"
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "cccp2"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "drop3"
  type: "Dropout"
  bottom: "pool1"
  top: "pool1"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "conv2"
  type: "Convolution" 
  bottom: "pool1"
  top: "conv2"
  param {
	  lr_mult: 1
	  decay_mult: 1
  }
  param {
	  lr_mult: 2
	  decay_mult: 0
  }
  convolution_param {
    num_output: 192
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "gaussian"
      std: 0.05
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu2"
  type: "ReLU"
  bottom: "conv2"
  top: "conv2"
}
layer {
  name: "cccp3"
  type: "Convolution"
  bottom: "conv2"
  top: "cccp3"
  param {
	  lr_mult: 1
	  decay_mult: 1
  }
  param {
	  lr_mult: 2
	  decay_mult: 0
  }
  convolution_param {
    num_output: 192
    group: 1
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.05
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu_cccp3"
  type: "ReLU" 
  bottom: "cccp3"
  top: "cccp3"
}
layer {
  name: "cccp4"
  type: "Convolution"
  bottom: "cccp3"
  top: "cccp4"
  param {
	  lr_mult: 1
	  decay_mult: 1
  }
  param {
	  lr_mult: 2
	  decay_mult: 0
  }
  convolution_param {
    num_output: 192
    group: 1
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.05
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu_cccp4"
  type: "ReLU"
  bottom: "cccp4"
  top: "cccp4"
}
layer {
  name: "pool2"
  type: "Pooling" 
  bottom: "cccp4"
  top: "pool2"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "drop6"
  type: "Dropout"
  bottom: "pool2"
  top: "pool2"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "conv3"
  type: "Convolution" 
  bottom: "pool2"
  top: "conv3"
  param {
	  lr_mult: 1
	  decay_mult: 1
  }
  param {
	  lr_mult: 2
	  decay_mult: 0
  }
  convolution_param {
    num_output: 192
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.05
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu3"
  type: "ReLU"
  bottom: "conv3"
  top: "conv3"
}
layer {
  name: "cccp5"
  type: "Convolution" 
  bottom: "conv3"
  top: "cccp5"
  param {
	  lr_mult: 1
	  decay_mult: 1
  }
  param {
	  lr_mult: 2
	  decay_mult: 0
  }
  convolution_param {
    num_output: 192
    group: 1
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.05
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu_cccp5"
  type: "ReLU"
  bottom: "cccp5"
  top: "cccp5"
}
layer {
  name: "cccp6"
  type: "Convolution"
  bottom: "cccp5"
  top: "cccp6"
  param {
	  lr_mult: 0.1
	  decay_mult: 1
  }
  param {
	  lr_mult: 0.1
	  decay_mult: 0
  }
  convolution_param {
    num_output: 100
    group: 1
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.05
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu_cccp6"
  type: "ReLU"
  bottom: "cccp6"
  top: "cccp6"
}
layer {
	name: "super_category"
	type: "SuperCategoryFM"
	bottom: "cccp6"
	top: "layer1"
	top: "layer2"
	eltwise_param {
		operation : MIN
	}
  super_category_param{
	  file_name : "super_category.prototxt"
  }
}
layer {
  name: "super_category_label"
  type: "SuperCategoryLabel"
  bottom: "label"
  top: "label_1"
  top: "label_2"
  super_category_param{
	  file_name : "super_category.prototxt"
  }
} 
layer {
	name: "SumOver"
	type: "SuperCategoryFMPost"
	eltwise_param {
		operation : MINUS
	}
	bottom: "layer1"
	bottom: "layer2"
	top: "layer11"
	top: "layer22"
	super_category_param {
		file_name : "super_category.prototxt"
	}
}
layer {
  name: "pool3"
  type: "Pooling" 
  bottom: "layer1"
  top: "pool3"
  pooling_param {
    pool: AVE
    kernel_size: 8
    stride: 1
  }
}
layer {
  name: "pool4"
  type: "Pooling" 
  bottom: "layer2"
  top: "pool4"
  pooling_param {
    pool: AVE
    kernel_size: 8
    stride: 1
  }
}
layer {
  name: "pool5_diff"
  type: "Pooling" 
  bottom: "layer22"
  top: "pool5_diff"
  pooling_param {
    pool: AVE
    kernel_size: 8
    stride: 1
  }
}
layer {
  name: "loss1"
  type: "SoftmaxWithLoss"
  bottom: "pool4"
  bottom: "label_2"
  top: "loss1"
  loss_weight: 0.4
}
layer {
  name: "loss2_supercategory"
  type: "SoftmaxWithLoss"
  bottom: "pool3"
  bottom: "label_1"
  top: "loss2_supercategory"
  loss_weight: 0.5
}
layer {
  name: "loss3_diffloss"
  type: "SoftmaxWithLoss"
  bottom: "pool5_diff"
  bottom: "label_2"
  top: "loss3_diffloss"
  loss_weight: 0.5
}
layer {
  name: "accuracy"
  type: "Accuracy"
  bottom: "pool4"
  bottom: "label"
  top: "accuracy"
  accuracy_param: {
	  top_k : 1
  }
}
layer {
  name: "accuracy_supercategory"
  type: "Accuracy"
  bottom: "pool3"
  bottom: "label_1"
  top: "accuracy_supercategory"
}
layer {
	name: "silence"
	type: "Silence"
	bottom: "layer11"
}
